tsung/old_tests/deposit_and_buy_flow.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='5000'/>
  </clients>
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="3" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="1" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="erlang" callback="ts_user_server:get_unique_id">
        <var name="username"/>
      </setdynvars>
      <request subst="true">
        <http url="/users.json"
              method="POST"
              content_type="application/json"
              contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;password&quot;, &quot;cash_balance&quot;: 10000.0}"
        />
      </request>
      <request subst="true">
        <http url="/sessions.json"
              method="POST"
              content_type="application/json"
              contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;password&quot;}"
        />
      </request>
      <request>
        <http url="/exchanges.json"
              method="POST"
              content_type="application/json"
              contents_from_file="./json/exchange_body.json"
        />
      </request>
      <thinktime value="2" random="true"/>
      <request>
        <http url="/transactions.json"
              method="POST"
              content_type='application/json'
              contents_from_file="./json/transaction_body.json"
        />
      </request>
      <request>
        <http url="/logout"
              method="GET"
              content_type="application/json"
        />
      </request>
    </session>
  </sessions>

</tsung>